LiveRestaurant_R-8.4/request.xml

<soapenv:Envelope xmlns:sch="http://www.packtpub.com/liverestaurant/OrderService/schema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509PKIPathv1" wsu:Id="X509-025EF80E5DEDA2C7D815758948443169">MIICcTCCAm0wggHWoAMCAQICBE4uvx4wDQYJKoZIhvcNAQEFBQAwezELMAkGA1UEBhMCTUUxEzARBgNVBAgTCk15UHJvdmluY2UxDzANBgNVBAcTBk15Q2l0eTESMBAGA1UEChMJTXlDb21wYW55MREwDwYDVQQLEwhTb2Z0d2FyZTEfMB0GA1UEAxMWTXlGaXJzdE5hbWUgTXlMYXN0TmFtZTAeFw0xMTA3MjYxMzIwMzBaFw0yMTA3MjYxMzIwMzBaMHsxCzAJBgNVBAYTAk1FMRMwEQYDVQQIEwpNeVByb3ZpbmNlMQ8wDQYDVQQHEwZNeUNpdHkxEjAQBgNVBAoTCU15Q29tcGFueTERMA8GA1UECxMIU29mdHdhcmUxHzAdBgNVBAMTFk15Rmlyc3ROYW1lIE15TGFzdE5hbWUwgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBAKDvNzKK7W3uKW1Qx+aBunDTHocb04cJFLF/PxI5xmkM5mQwyIRyTWG7zY+rssXG8rVroAQzZTeq0xSRymtEcQW+fSlMzZ+DeXfkUEeiuaQwkh/acnlgQrke+q+2Pebwp/b6buSsNHPvkYpWuqIEcoZLF0QQtU/KlWKWrvKdUVdpAgMBAAEwDQYJKoZIhvcNAQEFBQADgYEAepC9EnbHxps+FtNAvwHms3u+ak3sfHggg0wJjkFg9xAyWCUimYgH93ALvsK+3Y9oZHxmrYBPmy/Dfkj6kqJzDIUiyofm7WdeZ5n/3W1PHRUC/hSW/WDo4PCDY8uzF96dn+lzXO5V7nx4eOAMggzt+ffxRkTF4QPXx6Xt1PCZkI4=</wsse:BinarySecurityToken><ds:Signature Id="SIG-025EF80E5DEDA2C7D8157589484431813" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="sch soapenv" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-025EF80E5DEDA2C7D8157589484431712"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="sch" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>1xTF62mB5qLBIJNwx+dOJ3s4DNE=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>I98OkOG95ErI1jTg1yD2kRoM2GVNyA6MZW9FVcRUDVUWiAoBvpp3Wg1DeiLf155sRefqq6sBoxGM
eDNuLZ5HOf9a1fDMPeFo5cXOknFEV51RVmh4tIGJF9TFZMFjviecnumac6s409HAr771XTqrOJ9E
0jmNIy5VCIAOxYo9mhg=</ds:SignatureValue><ds:KeyInfo Id="KI-025EF80E5DEDA2C7D8157589484431610"><wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509PKIPathv1" wsu:Id="STR-025EF80E5DEDA2C7D8157589484431611" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"><wsse:Reference URI="#X509-025EF80E5DEDA2C7D815758948443169" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509PKIPathv1"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security>
   
   
      
   </soapenv:Header>
   <soapenv:Body wsu:Id="id-025EF80E5DEDA2C7D8157589484431712" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <sch:placeOrderRequest>
         <sch:order>
            <sch:refNumber>?</sch:refNumber>
            <sch:customer>
               <sch:addressPrimary>
                  <sch:doorNo>?</sch:doorNo>
                  <sch:building>?</sch:building>
                  <sch:street>?</sch:street>
                  <sch:city>?</sch:city>
                  <sch:country>?</sch:country>
                  <sch:phoneMobile>?</sch:phoneMobile>
                  <sch:phoneLandLine>?</sch:phoneLandLine>
                  <sch:email>?</sch:email>
               </sch:addressPrimary>
               <sch:addressSecondary>
                  <sch:doorNo>?</sch:doorNo>
                  <sch:building>?</sch:building>
                  <sch:street>?</sch:street>
                  <sch:city>?</sch:city>
                  <sch:country>?</sch:country>
                  <sch:phoneMobile>?</sch:phoneMobile>
                  <sch:phoneLandLine>?</sch:phoneLandLine>
                  <sch:email>?</sch:email>
               </sch:addressSecondary>
               <sch:name>
                  <sch:fName>?</sch:fName>
                  <sch:mName>?</sch:mName>
                  <sch:lName>?</sch:lName>
               </sch:name>
            </sch:customer>
            <sch:dateSubmitted>?</sch:dateSubmitted>
            <sch:orderDate>?</sch:orderDate>
            <!--1 or more repetitions:-->
            <sch:items>
               <sch:type>?</sch:type>
               <sch:name>?</sch:name>
               <sch:quantity>?</sch:quantity>
            </sch:items>
         </sch:order>
      </sch:placeOrderRequest>
   </soapenv:Body>
</soapenv:Envelope>
